<h1>
        1 задание
    </h1>

    <p>Фамилии студентов из массива:</p>

    <?php 
     $user=array("Иванов","Кляшев","сидоров","голубин","бобров","тимофеев","балабин");//создание массива
    
   foreach($user as $name){
    echo   $name . "<br>" ;
   } ?>

   <p>Подсчет количества элементов: <? echo count($user);?> </p>

 

<?php

 $user=array("Иванов","Кляшев","Сидоров","голубин","бобров","тимофеев","балабин");
 

    if(in_array('Сидоров',$user)){
      echo 'Проверка на фамилию Сидоров успешна';
    }else {
        echo ' Проверка на фамилию Сидоров показала отрицательный результат';
    }
?>

<?php 
$user=array("Иванов","Кляшев","Сидоров","голубин","бобров","тимофеев","балабин");
$expelled=array_pop($user);?>

<p>Удаленный элемент: <?php echo $expelled;?></p>



